BUILD/doc/source/_static/soap_outputs/6.5.314.4301/deploy_action_with_params_against_windows_computers_step_27_request.xml

<?xml version="1.0" encoding="utf-8"?>
<SOAP-ENV:Envelope xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance">
  <SOAP-ENV:Body>
    <typens:tanium_soap_request xmlns:typens="urn:TaniumSOAP">
      <command>GetObject</command>
      <object_list>
        <action>
          <comment>Created by PyTan v2.1.0</comment>
          <status>Open</status>
          <distribute_seconds>0</distribute_seconds>
          <start_time>2015-09-04T02:46:02</start_time>
          <creation_time>2015-09-04T02:46:00</creation_time>
          <skip_lock_flag>0</skip_lock_flag>
          <id>525</id>
          <expire_seconds>660</expire_seconds>
          <name>API Deploy Custom Tagging - Add Tags</name>
          <stopped_flag>0</stopped_flag>
          <expiration_time>2015-09-04T02:57:02</expiration_time>
          <approver>
            <name>Administrator</name>
            <id>1</id>
          </approver>
          <package_spec>
            <name>Custom Tagging - Add Tags</name>
            <command>cmd /c cscript //T:60 add-tags.vbs "tag%5fshould%5fbe%5fadded"</command>
            <id>411</id>
          </package_spec>
          <saved_action>
            <id>501</id>
          </saved_action>
          <history_saved_question>
            <id>228</id>
          </history_saved_question>
          <target_group>
            <name>Default</name>
            <id>3042</id>
          </target_group>
          <action_group>
            <name>Default</name>
            <id>0</id>
          </action_group>
          <user>
            <name>Administrator</name>
            <last_login>2015-09-04T02:45:44</last_login>
            <group_id>0</group_id>
            <id>1</id>
          </user>
        </action>
      </object_list>
      <options>
        <suppress_object_list>1</suppress_object_list>
      </options>
    </typens:tanium_soap_request>
  </SOAP-ENV:Body>
</SOAP-ENV:Envelope>